Revit 2027 API
EmbodiedCarbonAsset.CategoryId Property
 Internal identifier of category. List of available categories can be retrieved from Sustainability API.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CategoryId { get; }
Public ReadOnly Property CategoryId As String
	Get
public:
property String^ CategoryId {
	String^ get ();
}
member CategoryId : string with get
Property Value
String
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace